<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.averell23.autopkg_munki.Cathode</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>NAME</key>
		<string>Cathode</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>stable</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Vintage Terminal</string>
			<key>developer</key>
			<string>Secret Geometry</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://store.secretgeometry.com/download.php?id=7</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
    </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Cathode.app</string>
			</dict>
		</dict>
    <dict>
      <key>Processor</key>
      <string>DmgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_root</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
      </dict>
    </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
