<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of Steam installer package and renames the package.</string>
  <key>Identifier</key>
  <string>com.github.averell23.autpkg_recipes.munki.davinci_resolve_a16</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Da Vinci Resolve</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps</string>
    <key>MUNKI_CATEGORY</key>
    <string>Media</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
 			<array>
 				<string>stable</string>
 			</array>
 			<key>category</key>
 			<string>%MUNKI_CATEGORY%</string>
 			<key>description</key>
 			<string>DaVinci Resolve 16 is the world’s only solution that combines professional 8K editing, color correction, visual effects and audio post production all in one software tool! .</string>
 			<key>developer</key>
 			<string>Blackmagic Design</string>
 			<key>name</key>
 			<string>%NAME%</string>
 			<key>unattended_install</key>
 			<true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>ParentRecipe</key>
  <string>com.github.haircut.pkg.DaVinciResolve16</string>
  <key>Process</key>
  <array>
  	<dict>
  		<key>Processor</key>
  		<string>MunkiImporter</string>
  		<key>Arguments</key>
  		<dict>
  			<key>pkg_path</key>
  			<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
  			<key>repo_subdirectory</key>
         <string>%MUNKI_REPO_SUBDIR%</string>
  		</dict>
  	</dict>
  </array>
</dict>
</plist>
