<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of Nextcloud installer package and renames the package.</string>
  <key>Identifier</key>
  <string>com.github.averell23.autpkg_recipes.munki.sweethome3d</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SweetHome3D</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps</string>
    <key>MUNKI_CATEGORY</key>
    <string>Utilities</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
 			<array>
 				<string>stable</string>
 			</array>
 			<key>category</key>
 			<string>%MUNKI_CATEGORY%</string>
 			<key>description</key>
 			<string>Sweet Home 3D is a free interior design application that helps you draw the plan of your house, arrange furniture on it and visit the results in 3D.</string>
 			<key>developer</key>
 			<string>eTeks</string>
 			<key>name</key>
 			<string>%NAME%</string>
 			<key>unattended_install</key>
 			<true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.github.sebtomasi.pkg.sweethome3d</string>
  <key>Process</key>
  <array>
  	<dict>
  		<key>Processor</key>
  		<string>MunkiImporter</string>
  		<key>Arguments</key>
  		<dict>
  			<key>pkg_path</key>
  			<string>%pkg_path%</string>
  			<key>repo_subdirectory</key>
         <string>%MUNKI_REPO_SUBDIR%</string>
  		</dict>
  	</dict>
  </array>
</dict>
</plist>
