<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.averell23.autopkg_munki.PurgeZoom</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>VERSION</key>
		<string>0.0.1</string>
		<key>PKG_ID</key>
		<string>org.github.averell23.purgezoom</string>
		<key>NAME</key>
		<string>PurgeZoom</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>stable</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Remove Zoom completely</string>
			<key>developer</key>
			<string>averell23</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
      <string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_request</key>
        <dict>
          <key>pkgroot</key>
          <string>./payload</string>
          <key>scripts</key>
          <string>./scripts</string>
          <key>pkgdir</key>
          <string>./build</string>
          <key>pkgname</key>
          <string>%NAME%-%VERSION%</string>
          <key>id</key>
          <string>%PKG_ID%</string>
          <key>version</key>
          <string>%VERSION%</string>
          <key>options</key>
          <string>purge_ds_store</string>
          <key>chown</key>
          <array>
          </array>
        </dict>
      </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
